Revit 2027 API
ElectricalSystem.IsBasePanelFeedThroughLugsOccupied Property
 Checks if the feed through lugs of the base panel is already occupied.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBasePanelFeedThroughLugsOccupied { get; }
Public ReadOnly Property IsBasePanelFeedThroughLugsOccupied As Boolean
	Get
public:
property bool IsBasePanelFeedThroughLugsOccupied {
	bool get ();
}
member IsBasePanelFeedThroughLugsOccupied : bool with get
Property Value
Boolean
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace